public enum TokenType {

    /**
     * Пробелы
     */

    SPACES,

    /**
     * Целое число
     */

    STRING,

    /**
     * Символ 'if'
     */

    IF,

    /**
     * Символ 'then'
     */

    THEN,

    /**
     * Символ 'else'
     */

    ELSE,

    /**
     * Символ ';'
     */

    END,

    /**
     * Символ '('
     */

    LPAR,

    /**
     * Символ ')'
     */

    RPAR,

    /**
     * Переменная
     */

    VAR,

    /**
     * Приравнивание
     */

    ASSIGN,

    /**
     * Больше
     */

    MORE,

    /**
     * Меньше
     */

    LESS,

    /**
     * Равно
     */

    EQUAL
}